f32c/arduino/hardware/f32c/riscv/boards.txt
menu.speed=CPU Speed
menu.ram=RAM Size

#
# FER ULX2S Board, f32c/riscv SoC, logical pin mapping
#
ulx2s_bram.name=FER ULX2S (Lattice XP2, 16 KB BRAM, RV32 @ 100 MHz)
ulx2s_bram.build.fcpu=100000000
ulx2s_bram.build.mcu=f32c
ulx2s_bram.build.core=f32c
ulx2s_bram.build.variant=ulx2s_logical
ulx2s_bram.build.extra_flags=--section-start=.init=0x200
ulx2s_bram.upload.tool=ujprog
ulx2s_bram.upload.protocol=hex
ulx2s_bram.upload.flags=-P{serial.port} -ra
ulx2s_bram.upload.maximum_size=15360
ulx2s_bram.upload.wait_for_upload_port=false
ulx2s_bram.upload.native_usb=false
ulx2s_bram.bootloader.file=ulx2s/ulx2s_8e_riscv_bram_100mhz.jed

#
# Lattice Brevia Board, f32c/riscv SoC
#
brevia.name=Lattice Brevia (Lattice XP2, 16 KB BRAM, RV32 @ 100 MHz)
brevia.build.fcpu=100000000
brevia.build.mcu=f32c
brevia.build.core=f32c
brevia.build.variant=ulx2s_logical
brevia.build.extra_flags=--section-start=.init=0x200
brevia.upload.tool=ujprog
brevia.upload.protocol=hex
brevia.upload.flags=-P{serial.port} -ra
brevia.upload.maximum_size=15360
brevia.upload.wait_for_upload_port=false
brevia.upload.native_usb=false

#
# Digilent / Xilinx Spartan-3E Starter Board, f32c/riscv SoC
#
s3.name=Xilinx Spartan Starter Boards (S3E / S3A, 32 KB BRAM, RV32 @ 70 MHz)
s3.build.fcpu=70000000
s3.build.mcu=f32c
s3.build.core=f32c
s3.build.variant=ulx2s_logical
s3.build.extra_flags=--section-start=.init=0x200
s3.upload.tool=ujprog
s3.upload.protocol=hex
s3.upload.flags=-P{serial.port} -ra
s3.upload.maximum_size=31744
s3.upload.wait_for_upload_port=false
s3.upload.native_usb=false

#
# Digilent / Xilinx Nexys-3 Spartan-6 Board, f32c/riscv SoC
#
nexys3_bram.name=Digilent Nexys-3 (Spartan-6, 32 KB BRAM, RV32 @ 80 MHz)
nexys3_bram.build.fcpu=80000000
nexys3_bram.build.mcu=f32c
nexys3_bram.build.core=f32c
nexys3_bram.build.variant=ulx2s_logical
nexys3_bram.build.extra_flags=--section-start=.init=0x200
nexys3_bram.upload.tool=ujprog
nexys3_bram.upload.protocol=hex
nexys3_bram.upload.flags=-P{serial.port} -ra
nexys3_bram.upload.maximum_size=31744
nexys3_bram.upload.wait_for_upload_port=false
nexys3_bram.upload.native_usb=false

#
# Digilent / Xilinx ZYBO Zinq-7000, f32c/riscv SoC
#
zybo_bram.name=Digilent ZYBO (ZINQ XC7Z010, 128 KB BRAM, RV32 @ 125 MHz)
zybo_bram.build.fcpu=125000000
zybo_bram.build.mcu=f32c
zybo_bram.build.core=f32c
zybo_bram.build.variant=ulx2s_logical
zybo_bram.build.extra_flags=--section-start=.init=0x200
zybo_bram.upload.tool=ujprog
zybo_bram.upload.protocol=hex
zybo_bram.upload.flags=-P{serial.port} -ra
zybo_bram.upload.maximum_size=130048
zybo_bram.upload.wait_for_upload_port=false
zybo_bram.upload.native_usb=false
zybo_bram.bootloader.openocd_cfg={runtime.platform.path}/bootloaders/zybo/ftdi-zybo.ocd
zybo_bram.bootloader.file_svf=zybo/zybo_riscv_bram_125mhz.svf

#
# Xilinx TB299 XC6SLX9 (ebay) Spartan-6 Board, f32c/riscv SoC
#
xc6slx9_bram.name=Xilinx TB299 (Spartan-6 XC6SLX9, 32 KB BRAM, RV32 @ 112.5 MHz)
xc6slx9_bram.build.fcpu=112500000
xc6slx9_bram.build.mcu=f32c
xc6slx9_bram.build.core=f32c
xc6slx9_bram.build.variant=ulx2s_logical
xc6slx9_bram.build.extra_flags=--section-start=.init=0x200
xc6slx9_bram.upload.tool=ujprog_openocd
xc6slx9_bram.upload.protocol=hex
xc6slx9_bram.upload.flags=-P{serial.port} -ra
xc6slx9_bram.upload.maximum_size=31744
xc6slx9_bram.upload.wait_for_upload_port=false
xc6slx9_bram.upload.native_usb=false
xc6slx9_bram.bootloader.file_svf=xc6slx9/xc6slx9_riscv_112mhz.svf
xc6slx9_bram.bootloader.openocd_cfg={runtime.platform.path}/bootloaders/xc6slx9/xc6slx9.ocd

#
# Altera DE0-Nano Board, f32c/riscv SoC
#
de0_nano_bram.name=Altera DE0-Nano (Cyclone IV E EP4CE22, 32 KB BRAM, RV32 @ 100 MHz)
de0_nano_bram.build.fcpu=100000000
de0_nano_bram.build.mcu=f32c
de0_nano_bram.build.core=f32c
de0_nano_bram.build.variant=ulx2s_logical
de0_nano_bram.build.extra_flags=--section-start=.init=0x200
de0_nano_bram.upload.tool=ujprog
de0_nano_bram.upload.protocol=hex
de0_nano_bram.upload.flags=-P{serial.port} -ra
de0_nano_bram.upload.maximum_size=31744
de0_nano_bram.upload.wait_for_upload_port=false
de0_nano_bram.upload.native_usb=false
de0_nano_bram.bootloader.file_jic=de0_nano/bitstream.jic

#
# Altera TB276 (ebay), f32c/riscv SoC
#
tb276_bram.name=Altera TB276 (Cyclone IV E EP4CE6, 16 KB BRAM, RV32 @ 112.5 MHz)
tb276_bram.build.fcpu=112500000
tb276_bram.build.mcu=f32c
tb276_bram.build.core=f32c
tb276_bram.build.variant=ulx2s_logical
tb276_bram.build.extra_flags=--section-start=.init=0x200
tb276_bram.upload.tool=ujprog_altera
tb276_bram.upload.protocol=hex
tb276_bram.upload.flags=-P{serial.port} -ra
tb276_bram.upload.maximum_size=15360
tb276_bram.upload.wait_for_upload_port=false
tb276_bram.upload.native_usb=false
tb276_bram.bootloader.file_jic=tb276/tb276_riscv_112mhz.jic
tb276_bram.bootloader.file_svf=tb276/tb276_riscv_112mhz.svf
tb276_bram.bootloader.openocd_cfg={runtime.platform.path}/bootloaders/tb276/tb276.ocd

#
# f32c/riscv SoC, logical pin mapping
#
f32c_riscv.name=Generic f32c/riscv
f32c_riscv.build.mcu=f32c
f32c_riscv.build.core=f32c
f32c_riscv.build.variant=ulx2s_logical
f32c_riscv.build.extra_flags=--section-start=.init=0x200
f32c_riscv.upload.tool=ujprog
f32c_riscv.upload.protocol=hex
f32c_riscv.upload.flags=-P{serial.port} -ra
f32c_riscv.upload.wait_for_upload_port=false
f32c_riscv.upload.native_usb=false
f32c_riscv.menu.build.fcpu=UNDEFINED
f32c_riscv.menu.ram.8=8 KB BRAM
f32c_riscv.menu.ram.8.upload.maximum_size=7168
f32c_riscv.menu.ram.16=16 KB BRAM
f32c_riscv.menu.ram.16.upload.maximum_size=15360
f32c_riscv.menu.ram.32=32 KB BRAM
f32c_riscv.menu.ram.32.upload.maximum_size=31744
f32c_riscv.menu.ram.64=64 KB BRAM
f32c_riscv.menu.ram.64.upload.maximum_size=64152
f32c_riscv.menu.ram.128=128 KB BRAM
f32c_riscv.menu.ram.128.upload.maximum_size=130048
f32c_riscv.menu.speed.10=10 MHz
f32c_riscv.menu.speed.10.build.fcpu=10000000
f32c_riscv.menu.speed.20=20 MHz
f32c_riscv.menu.speed.20.build.fcpu=20000000
f32c_riscv.menu.speed.25=25 MHz
f32c_riscv.menu.speed.25.build.fcpu=25000000
f32c_riscv.menu.speed.30=30 MHz
f32c_riscv.menu.speed.30.build.fcpu=30000000
f32c_riscv.menu.speed.33=33 MHz
f32c_riscv.menu.speed.33.build.fcpu=33333333
f32c_riscv.menu.speed.40=40 MHz
f32c_riscv.menu.speed.40.build.fcpu=40000000
f32c_riscv.menu.speed.50=50 MHz
f32c_riscv.menu.speed.50.build.fcpu=50000000
f32c_riscv.menu.speed.60=60 MHz
f32c_riscv.menu.speed.60.build.fcpu=60000000
f32c_riscv.menu.speed.66=66.6 MHz
f32c_riscv.menu.speed.66.build.fcpu=66666666
f32c_riscv.menu.speed.70=70 MHz
f32c_riscv.menu.speed.70.build.fcpu=70000000
f32c_riscv.menu.speed.75=75 MHz
f32c_riscv.menu.speed.75.build.fcpu=75000000
f32c_riscv.menu.speed.80=80 MHz
f32c_riscv.menu.speed.80.build.fcpu=80000000
f32c_riscv.menu.speed.90=90 MHz
f32c_riscv.menu.speed.90.build.fcpu=90000000
f32c_riscv.menu.speed.100=100 MHz
f32c_riscv.menu.speed.100.build.fcpu=100000000
f32c_riscv.menu.speed.112=112.5 MHz
f32c_riscv.menu.speed.112.build.fcpu=112500000
f32c_riscv.menu.speed.125=125 MHz
f32c_riscv.menu.speed.125.build.fcpu=125000000
f32c_riscv.menu.speed.133=133.3 MHz
f32c_riscv.menu.speed.133.build.fcpu=133333333
f32c_riscv.menu.speed.150=150 MHz
f32c_riscv.menu.speed.150.build.fcpu=150000000
f32c_riscv.menu.speed.166=166.6 MHz
f32c_riscv.menu.speed.166.build.fcpu=166666666
